[
  {
    "title": "Market Basket Analysis",
    "imageSrc": "projects/mba.png",
    "description": "The Market Basket Analysis System is a data-driven application designed to identify purchasing patterns and correlations between products. By analyzing transaction data, the system helps businesses understand customer behavior, optimize product placement, and improve sales strategies. The project leverages data mining techniques and association rule algorithms to generate actionable insights from large datasets.",
    "skills": ["Python", "Pandas", "NumPy"],
    "source": "https://github.com/vardhanmunagala/Market-Basket-Analysis"
  },
  {
    "title": "ToDo Application",
    "imageSrc": "projects/todo_application.png",
    "description": "The ToDo Application is a productivity tool designed to help users efficiently organize, manage, and prioritize daily tasks. It features a user-friendly interface that enables users to create, edit, and track tasks with minimal effort, boosting personal and professional productivity.",
    "skills": ["Flask", "JavaScript", "Docker"],
    "source": "https://github.com/vardhanmunagala/Todo_App_Flask_Docker"
  },
  {
    "title": "Recipe Management System",
    "imageSrc": "projects/online_book_store.png",
    "description": "The Recipe Management System is a full-stack web application designed to simplify and enhance the process of storing, managing, and discovering recipes. It provides an intuitive interface for users to create, edit, delete, and filter recipes based on categories and keywords. This application is ideal for individuals looking to organize their culinary repertoire or share recipes with others.",
    "skills": ["React", "SpringBoot", "MySQL"],
    "source": "https://github.com/vardhanmunagala/Recipe-Management-System-Frontend"
  },
  {
    "title": "Olympic Games",
    "imageSrc": "projects/olympics.png",
    "description": "The Olympics Game Management System project focuses on developing a centralized data warehouse to store, process, and analyze historical and ongoing data related to the Olympic Games. This system empowers stakeholders to make data-driven decisions, manage event logistics, and generate insightful analytics for improved event management and audience engagement.",
    "skills": ["Sql", "AWS S3", "Redshift"]
  },
  {
    "title": "Sales Performance",
    "imageSrc": "projects/sales_performance_dashboard.png",
    "description": "This project involves the creation of an interactive and visually intuitive dashboard to analyze and track sales performance across different regions, products, and time periods. The dashboard empowers business stakeholders with actionable insights, enabling data-driven decision-making to optimize sales strategies and improve revenue growth.",
    "skills": ["Tableau", "Excel"],
    "source": "https://github.com/vardhanmunagala/Sales-Dashboard"
  },
  {
    "title": "Sales Prediction",
    "imageSrc": "projects/walmart.png",
    "description": "The Walmart Sales Prediction project aims to forecast weekly sales across multiple Walmart stores using historical sales data. By leveraging data analytics and machine learning techniques, this project identifies key trends and contributing factors that influence sales, enabling data-driven decision-making and inventory optimization.",
    "skills": ["Python", "Machine Learning"],
    "source": "https://github.com/vardhanmunagala/Walmart-Store-Sales-Prediction-"
  }
]
